#pragma once

//============================================================================
//	include
//============================================================================
#include <Engine/Object/Core/ObjectPool.h>

// front
class ObjectPoolManager;

//============================================================================
//	ISystem class
//	データ更新システムのインターフェース
//============================================================================
class ISystem {
public:
	//========================================================================
	//	public Methods
	//========================================================================

	ISystem() = default;
	virtual ~ISystem() = default;

	// タイプシグネチャ取得
	virtual Archetype Signature() const = 0;
	// タイプシグネチャでフィルタリングされたオブジェクトの更新
	virtual void Update(ObjectPoolManager& ObjectPoolManager) = 0;
};