#pragma once

//============================================================================
//	include
//============================================================================
#include <Engine/Object/Base/GameObject2D.h>

//============================================================================
//	TitleBackground class
//	タイトルの背景処理
//============================================================================
class TitleBackground {
public:
	//========================================================================
	//	public Methods
	//========================================================================

	TitleBackground() = default;
	~TitleBackground() = default;

	// 初期化処理
	void Init();

	// 更新処理
	void Update();

	// エディター
	void ImGui();

	// json
	void FromJson(const Json& json);
	void ToJson(Json& json) const;

	//--------- accessor -----------------------------------------------------

private:
	//========================================================================
	//	private Methods
	//========================================================================

	//--------- variables ----------------------------------------------------

	// 背景
	std::unique_ptr<GameObject2D> background_;

	// タイトルの名前
	std::unique_ptr<GameObject2D> titleName_;

	//--------- functions ----------------------------------------------------

};