#pragma once

//============================================================================
//	include
//============================================================================
#include <Engine/Editor/Camera/3D/CameraPathData.h>

//============================================================================
//	CameraPathRenderer class
//	カメラのキーパスの描画を行う
//============================================================================
class CameraPathRenderer {
public:
	//========================================================================
	//	public Methods
	//========================================================================

	CameraPathRenderer() = default;
	~CameraPathRenderer() = default;

	static void DrawLine3D(const CameraPathData& data);
};