#pragma once

//============================================================================
//	include
//============================================================================

// c++
#include <cstdint>

//============================================================================
//	MeshRenderStructure
//============================================================================

// 描画先
enum class MeshRenderView :
	uint8_t {

	// 描画しない
	None = 0,
	// ゲーム画面にのみ描画
	Game = 1 << 0,
	// シーン画面にのみ描画
	Scene = 1 << 1,
	// 両方に描画
	Both = static_cast<uint8_t>(Game) | static_cast<uint8_t>(Scene),
};